
#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`

<details>
<summary>Show Plan</summary>

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # time_rotating.day has been deleted
  - resource "time_rotating" "day" {
        id               = "2023-03-14T00:36:24Z"
      - rfc3339          = "2023-03-14T00:36:24Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.repositories[".github"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"3580f3fb28165d53f30bd27e09c4cf852b7393c013371024301ed63cb60cf66b\"" -> "W/\"4552ffb7b8c3c2f3c155188412105d99470cba9347530494e3d031166055c1c2\""
        id                                      = ".github"
        name                                    = ".github"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (3 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-android-anki-chinese-flashcards-enricher"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ description                             = "Android app to streamline my Chinese learning workflow" -> "Android app I plan to make"
      ~ etag                                    = "W/\"335a9fcaf49b480e2648847957dcace8a13f088f9e98ceac1305a7aee767ad17\"" -> "W/\"f632ad0f66fbfb8bb8cbc1663d6a45c5783a59036e29335384206f3d33c12631\""
        id                                      = "app-android-anki-chinese-flashcards-enricher"
        name                                    = "app-android-anki-chinese-flashcards-enricher"
      ~ topics                                  = [
          - "android",
          - "app",
          - "kotlin",
            # (1 unchanged element hidden)
        ]
        # (35 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-cli-autoscroll"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"4299be4030e67f1f24775f84f7712186158863b987402c7f6698ddd0ec81f51a\"" -> "W/\"63bc869f590bdc5be9617017f61ac70b9cabb7e2c526826468e30861b06d9d1d\""
        id                                      = "app-cli-autoscroll"
        name                                    = "app-cli-autoscroll"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (7 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-desktop-useless-cpp-gui"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"ef7864f01082bfc964078ca16fa4f129c0d7c6dedeb1c0253c60d3f1b2827c80\"" -> "W/\"c68aa00474678da364dff2b0a26e2ef30de149e33f1cde5c9e92469c08e56a02\""
        id                                      = "app-desktop-useless-cpp-gui"
        name                                    = "app-desktop-useless-cpp-gui"
        # (37 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-web-crawler-book-creator"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"7aebeb903a5435321451f5b282fb1cf408dc5e9f43b4fa40d518d21fd95fbaa4\"" -> "W/\"9a165a78befc8ff7362bca9cf26e7c80179da3272880f89d68a14ddad575aea7\""
        id                                      = "app-web-crawler-book-creator"
        name                                    = "app-web-crawler-book-creator"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (14 unchanged elements hidden)
        ]
      ~ vulnerability_alerts                    = true -> false
        # (35 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-web-django-assignment"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"e75c19ba33990a0def71a656b74d5b27a230dcf93a2d51fa6e3f6ff6b6b280d4\"" -> "W/\"ab17c1cfd404f4a049ef485058c368937cec7f725f31790af9940dfa0a9e678c\""
        id                                      = "app-web-django-assignment"
        name                                    = "app-web-django-assignment"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (15 unchanged elements hidden)
        ]
      ~ vulnerability_alerts                    = true -> false
        # (35 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["app-web-tianyi"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"95ae81d0951660da45ed6a6848e8b39ca0036709fc843575ade9f9acd56655b8\"" -> "W/\"feb490e9a511a7caa4517d06146f2803f1ae689a5e4cb027f92d4fce98594acf\""
        id                                      = "app-web-tianyi"
        name                                    = "app-web-tianyi"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (14 unchanged elements hidden)
        ]
      ~ vulnerability_alerts                    = true -> false
        # (35 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["ci-actions-common"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"56dd064ee7b15f1de075599320a22fedcfabecb40c315d5e12fc985144caceae\"" -> "W/\"5e06fc2d2c4a39494dc7a67360e99357c2eab1cfbae7917c860d550999d65b2c\""
        id                                      = "ci-actions-common"
        name                                    = "ci-actions-common"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (5 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }

      + template {
          + include_all_branches = false
          + owner                = "shishifubing"
          + repository           = "template-repository-default"
        }
    }

  # module.repositories["infra-cloud-shishifubing.com"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"3bec6db20feec750d6725c0b5d221a57acbc09bd92a36e242a7abd3e4c66b00a\"" -> "W/\"bd4e6a87df79c806b7adfb9be45fe99cd8da9d7784db964468e413662cea5ec9\""
        id                                      = "infra-cloud-shishifubing.com"
        name                                    = "infra-cloud-shishifubing.com"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (9 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["infra-repos-shishifubing"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"03815a0a002b72b9e9c423206466e63d8d01b5b039749b4dfb0d9d4cab0a903c\"" -> "W/\"af91b823a95173e4a6e1db7ef797f7f6922d7b5091e7df41a8e718f9abc5e072\""
        id                                      = "infra-repos-shishifubing"
        name                                    = "infra-repos-shishifubing"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (5 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["misc-personal-dotfiles"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"55b4370e9bf2eb2774b57dc9b4ddc41c4fa77e9f4b8cdb41c69648a64e5890ee\"" -> "W/\"a452525d9155e3d3a097056a588990ddbeb96c0352e17bd318ccfe4418c04dcd\""
        id                                      = "misc-personal-dotfiles"
        name                                    = "misc-personal-dotfiles"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (8 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["plugin-firefox-new-tab-bookmarks"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"3e0f081db6098712dd67da738ad44968335d3d3359cb202e22b15e55985aee88\"" -> "W/\"58683e51dfe313ffec95e96f64d3e2270a24eb4efa965ae5e8f4688025fff850\""
        id                                      = "plugin-firefox-new-tab-bookmarks"
        name                                    = "plugin-firefox-new-tab-bookmarks"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (10 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["plugin-sonatype-nexus-security-check"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"d52d04dae65551a27c2328c24b4f064a1a16b895086bbd55467e0c4756a72775\"" -> "W/\"4edc250d2c34a9c4149404ebc48508f30a49f57b71d13cd59d8f768523faf6f7\""
        id                                      = "plugin-sonatype-nexus-security-check"
        name                                    = "plugin-sonatype-nexus-security-check"
      ~ vulnerability_alerts                    = true -> false
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["shishifubing.github.io"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"237c9496a6f8c274db83c5e1d8e12619e630f03cbf66dc539dc22f38772b6458\"" -> "W/\"f4d66c43ecf3fa32f4633786c5358f99fe9b55aca8e615ab7181877ad8b4e757\""
        id                                      = "shishifubing.github.io"
        name                                    = "shishifubing.github.io"
        # (37 unchanged attributes hidden)

      ~ pages {
            # (5 unchanged attributes hidden)

          ~ source {
              ~ branch = "ghpages" -> "gh-pages"
                # (1 unchanged attribute hidden)
            }
        }

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["snippets-golang-leetcode"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"c2e13ba423c6af05a805071269ac3836bea5d07901843bbebe10b94ba7f45c33\"" -> "W/\"177a6eb436502b35dc3c42531068ccdbdb33261b7aa9ef9f5ddbadabd83e93b2\""
        id                                      = "snippets-golang-leetcode"
        name                                    = "snippets-golang-leetcode"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (5 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["snippets-javascript-assignments"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"a1a9fdd9388ba0d912430207bedbd47df58fa06c1d7710d2dff2e70371a202e4\"" -> "W/\"56dd43c2886e8ffe40f910ed17b6f406824e27907cad09d41f0a250d71d63602\""
        id                                      = "snippets-javascript-assignments"
        name                                    = "snippets-javascript-assignments"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (7 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ pages {
          - cname      = "shishifubing.com" -> null
            # (4 unchanged attributes hidden)

          ~ source {
              ~ branch = "ghpages" -> "gh-pages"
                # (1 unchanged attribute hidden)
            }
        }

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["template-repository-default"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"6c89fef2409e215c6c2709638536e8ada17f47078c9b0bd32ef82384bb21316e\"" -> "W/\"9e9e9c6a50dcd71b8a6a30d7aea54330236be2ba6561befed3526d804e2a3324\""
        id                                      = "template-repository-default"
        name                                    = "template-repository-default"
        # (37 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_organization_settings.organization will be updated in-place
  ~ resource "github_organization_settings" "organization" {
      ~ advanced_security_enabled_for_new_repositories               = false -> true
        id                                                           = "122202585"
      ~ secret_scanning_push_protection_enabled_for_new_repositories = false -> true
        # (19 unchanged attributes hidden)
    }

  # github_team_repository.owners[".github"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = ".github"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["app-android-anki-chinese-flashcards-enricher"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-android-anki-chinese-flashcards-enricher"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["app-cli-autoscroll"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-cli-autoscroll"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["app-desktop-useless-cpp-gui"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-desktop-useless-cpp-gui"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["app-web-crawler-book-creator"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-web-crawler-book-creator"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["app-web-django-assignment"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-web-django-assignment"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["app-web-tianyi"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "app-web-tianyi"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["ci-actions-common"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "ci-actions-common"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["infra-cloud-shishifubing.com"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "infra-cloud-shishifubing.com"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["infra-repos-shishifubing"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "infra-repos-shishifubing"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["misc-personal-dotfiles"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "misc-personal-dotfiles"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["plugin-firefox-new-tab-bookmarks"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "plugin-firefox-new-tab-bookmarks"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["plugin-sonatype-nexus-security-check"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "plugin-sonatype-nexus-security-check"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["shishifubing.github.io"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "shishifubing.github.io"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["snippets-golang-leetcode"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "snippets-golang-leetcode"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["snippets-javascript-assignments"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "snippets-javascript-assignments"
      + team_id    = "7573764"
    }

  # github_team_repository.owners["template-repository-default"] will be created
  + resource "github_team_repository" "owners" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "template-repository-default"
      + team_id    = "7573764"
    }

  # gitlab_project.repositories[".github"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = (known after apply)
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/.github.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "dot-github"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "readme",
          + "readme-profile",
          + "shishifubing",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-android-anki-chinese-flashcards-enricher"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = (known after apply)
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-android-anki-chinese-flashcards-enricher.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "app-android-anki-chinese-flashcards-enricher"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "android",
          + "app",
          + "kotlin",
          + "shishifubing",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-cli-autoscroll"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = (known after apply)
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-cli-autoscroll.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "app-cli-autoscroll"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "cli-app",
          + "finished",
          + "finished-project",
          + "pyqt5",
          + "python",
          + "python3",
          + "shishifubing",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-desktop-useless-cpp-gui"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = (known after apply)
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-desktop-useless-cpp-gui.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "app-desktop-useless-cpp-gui"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "abandoned",
          + "abandoned-project",
          + "appimage",
          + "ci",
          + "cpp",
          + "desktop-app",
          + "gui",
          + "qt",
          + "qt5",
          + "shishifubing",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-web-crawler-book-creator"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = (known after apply)
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-web-crawler-book-creator.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "app-web-crawler-book-creator"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "abandoned",
          + "abandoned-project",
          + "app",
          + "css",
          + "css3",
          + "django",
          + "html",
          + "html5",
          + "javascript",
          + "python",
          + "python3",
          + "shishifubing",
          + "web-scraping",
          + "webapp",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-web-django-assignment"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = (known after apply)
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-web-django-assignment.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "app-web-django-assignment"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "app",
          + "bootstrap",
          + "css",
          + "css3",
          + "django",
          + "finished",
          + "finished-project",
          + "html",
          + "html5",
          + "javascript",
          + "python",
          + "python3",
          + "shishifubing",
          + "ssr",
          + "webapp",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-web-tianyi"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = (known after apply)
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-web-tianyi.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level   ...
```

</details>
Output is too long and was truncated. You can read full Plan in <a href="https://github.com/shishifubing/infra-repos-shishifubing/actions/runs/4459806376">Actions</a>.<br /><br />

Pushed by: @tiandaoburen
Action: `pull_request`
